WithBaffles/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22059;
        startFace       712769;
    }
    baffle1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4494;
        startFace       734828;
    }
    baffle2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4478;
        startFace       739322;
    }
    baffle3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4444;
        startFace       743800;
    }
)

// ************************************************************************* //
