WithBaffles/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    timeStep;
    writeInterval   1;

    patches         ("sphere1");
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1000;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (0 1 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (1 0 0);
    magUInf         1e-4;
    lRef            1;        
    Aref            0.785;        
}


// ************************************************************************* //
